
{"items":[{"by":"sangwen","id":16059492,"score":1,"time":1514969446,"title":"Smarking (YC W15) Is Hiring Sr.PM in SF","type":"job","url":"https:\/\/jobs.lever.co\/smarking\/e75f2eb0-c227-47c8-8ceb-9ceb1bb907b7"},{"by":"jon_dahl","id":16058344,"score":1,"text":"We&#x27;re a team of video experts (creators of Zencoder, Video.js, Demuxed, etc.) working to solve an important problem: how do companies stream video well, at scale, on any device, at low cost? Think Twilio for video.<p>Mux Video is an API-first platform designed by video experts to make beautiful video possible for for every development team. Powered by data, encoding and delivery are self-optimizing to work perfectly on every device, every time.<p>Unlike everyone else in the video technology space, Mux Video is developer focused, API driven, and powered by data.<p>See <a href=\"https:&#x2F;&#x2F;mux.com&#x2F;video\" rel=\"nofollow\">https:&#x2F;&#x2F;mux.com&#x2F;video<\/a> for more.<p>Apply at <a href=\"http:&#x2F;&#x2F;mux.workable.com\" rel=\"nofollow\">http:&#x2F;&#x2F;mux.workable.com<\/a>.","time":1514953103,"title":"Mux is hiring engineers to help build the best video streaming stack","type":"job"},{"by":"katyashe","id":16057269,"score":1,"time":1514939253,"title":"Noora Health Seeking Health Data\/Researcher for Director of Impact Role (India)","type":"job","url":"https:\/\/goo.gl\/PaKtvv"},{"by":"mkong1","id":16055567,"score":1,"text":"GiveCampus is a Y Combinator-backed company that builds fundraising software for educational institutions. We&#x27;re working to bring actual innovation to the space, and solve the hair-on-fire problems fundraisers face. We&#x27;re tired of schools being stuck with crappy software that never changes.<p>We&#x27;re growing at an awesome pace, and now need more motivated engineers to help us build out the features and products schools want! Michael Seibel, CEO of YC, expects us to be a household name in the next few years: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13896296\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13896296<\/a>. We were also covered by the Washington Post last year (<a href=\"https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;grade-point&#x2F;wp&#x2F;2016&#x2F;04&#x2F;19&#x2F;colleges-are-going-online-to-crowdsource-donations-and-theyre-raising-millions&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;grade-point&#x2F;wp&#x2F;2016&#x2F;04&#x2F;1...<\/a>), and we have grown the number of schools using us by more than 5x since the article was published.<p>We&#x27;re still a small team, so if you&#x27;re looking to join a fast-growing startup and have an immediate impact, we&#x27;re looking for both full-stack (Ruby on Rails, Postgres) and front-end engineers with at least 2 years of professional experience. Our current team was previously with Facebook, Amazon, and Intel.<p>Please no recruiters or dev shops.<p>Reach out to careers@givecampus.com with a bit about why you&#x27;re passionate about education, and a project you&#x27;ve working on that you&#x27;re particularly proud of.  We&#x27;re based in DC with an office in SF, so we&#x27;re looking to hire in both locations.","time":1514926787,"title":"GiveCampus (YC S15) helping schools raise money more efficiently","type":"job"},{"by":"kanjun","id":16052855,"score":1,"time":1514910443,"title":"Join Sourceress (YC S17) as tech lead to build AI to get people jobs that matter","type":"job","url":"https:\/\/www.sourceress.com\/jobs"},{"by":"jstreebin","id":16050271,"score":1,"time":1514874428,"title":"EasyPost is hiring","type":"job","url":"https:\/\/www.easypost.com\/jobs"},{"by":"thedogeye","id":16045516,"score":1,"time":1514801295,"title":"New Year, New Job: Flexport is hiring for almost every kind of role","type":"job","url":"https:\/\/flexport.com\/careers"},{"by":"ayw","id":16044455,"score":1,"time":1514776364,"title":"Scale API is hiring engineers and ML practitioners","type":"job","url":"https:\/\/www.scaleapi.com\/about#jobs"},{"by":"nimz","id":16043593,"score":1,"time":1514762514,"title":"Fullstack Academy (YC S12) is hiring devs in New York who love teaching","type":"job","url":"https:\/\/www.workable.com\/j\/279B5D89EA"},{"by":"KMinshew","id":16036858,"score":1,"time":1514661126,"title":"Join the Muse (YC W12) as Our Lead Dev Ops Engineer","type":"job","url":"https:\/\/www.themuse.com\/jobs\/themuse\/lead-devops-engineer"},{"by":"the_economist","id":16032150,"score":1,"time":1514583275,"title":"BuildZoom (YC W13) is hiring an engineering manager","type":"job","url":"https:\/\/jobs.lever.co\/buildzoom\/5d98e8d6-b8be-4871-a1de-109af3cb204d"},{"by":"shipoftheseus","id":16030350,"score":1,"text":"About us:<p>Stitch Health is a care coordination platform for healthcare teams. Our mission is to deliver real impacts on healthcare outcomes by improving the ability for patients and providers to collaborate. Our software suite includes tools for team messaging, patient messaging, and patient management, delivered through modern web and mobile technologies. Our users are healthcare teams — consisting of doctors, nurses, social workers, pharmacists and more — and their patients.<p>Our technology recognizes the need for healthcare teams to easily access critical patient data wherever they are, from any device. To achieve this, our stack is Elixir&#x2F;Phoenix&#x2F;PostgreSQL on the back-end, React on the front-end, native iOS and Android, and Electron for desktop. Today, we’re a small but cohesive team. We’re growing fast and expanding our engineering team over the next several months.<p>Stitch is based in San Francisco, CA and is backed by some of the world&#x27;s best investors, including Benchmark Capital and Y Combinator. We&#x27;ve raised a Series A round and already serve over 70 healthcare organizations every day.<p>Available roles:<p>- Android Software Engineer<p>- iOS Software Engineer<p>- Electron Engineer<p>- Senior Frontend Engineer<p>- Senior Backend Engineer<p>- Software Architect<p>- QA Engineer<p>Some projects we&#x27;re working on:<p>- Architecture for adding in additional modules to our platform, enabling us to open new lines of business.<p>- Optimistic UI so providers can continue caring for patients across a range of suboptimal settings, from offline to low connectivity.<p>- Open API for customers to begin adding custom integrations.<p>- Analytics services that provides population health insights based on patient data flowing through Stitch teams, for example search term trends within Stitch.<p>This is a full-time role based in our San Francisco office.<p>For more information on each role: teamstitch.com&#x2F;jobs<p>Feel free to directly contact me as well: jonathan@teamstitch.com","time":1514566377,"title":"Stitch Health Hiring iOS, Android, Electron, React and Elixir Engineers","type":"job"},{"by":"vikeshkhanna","id":16028705,"score":1,"text":"At Ambient.ai, we&#x27;re looking for exceptional software engineers, both on-site (San Francisco Bay Area) and remote, to join our engineering team and change the future of computer vision.<p>Ambient.ai is an early-stage, stealth-mode company founded by Stanford alumni with a mission to solve general vision AI and achieve human-level visual intelligence. We&#x27;re using cutting-edge deep learning and computer vision to solve an incredibly important real-world problem. We&#x27;re backed by YC (W17), Stanford StartX, SV Angel, Inevitable Ventures, among others.<p>We’re hiring in two roles for our early engineering team:<p>1) Full-Stack Software Engineer: You take pride in the breadth of your skills and work across the whole stack: frontend, backend, microservices and databases. You can design and implement complex backend architectures, write clean and maintainable APIs, design database schemas, implement and deploy distributed systems and have the ability to learn new web frameworks quickly and often.<p>2) Applied Deep Learning Engineer: You have a penchant for turning research ideas into products. You are well versed with latest computer vision research and have the ability to prototype and productionize deep neural networks under strict time constraints.<p>(You can read more about the roles here: <a href=\"https:&#x2F;&#x2F;ambient.ai&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;ambient.ai&#x2F;careers<\/a>)<p>This is a unique opportunity to be a part of our journey early on and build a breakthrough product in the computer vision space. Apply by sending your resume to careers@ambient.ai","time":1514542553,"title":"Ambient.ai (YC W17) Is Hiring Software Engineers (Founding Team)","type":"job"},{"by":"jweins","id":16028103,"score":1,"time":1514530642,"title":"Dahmakan (YC S17) Is Hiring a Senior Performance Marketer in SE Asia","type":"job","url":"http:\/\/join.dahmakan.com\/o\/performance-marketing-manager"},{"by":"nanzhong","id":16025046,"score":1,"text":"Solving our own pain point, we are automating insurance shopping for American consumers. After a quick signup, a consumer&#x27;s insurance shopping and management are put on autopilot with us. Better deals automatically come to them for the rest of their lives. Switching takes only a single tap. It will save consumers time and money while giving them better protection.<p>Bugs in our system could mess up people&#x27;s lives big time. If you take pride in writing code that &quot;just works&quot;, if you love turning an idea into a deployed feature in minutes, you&#x27;ll love it here. Practical experience with Python&#x2F;Django, SQL and automated testing strongly preferred. Practical experience with Ruby&#x2F;Rails or Java will be considered too.<p>Please contact jobs@safebutler.com. We are a 4-person team based in Newark CA (across the bay from Facebook HQ). The company is backed by a group of angels, including YouTube co-founder.  At this point, Bay Area candidates with US citizenship or greencard only please.","time":1514496676,"title":"SafeButler (YC S17) is hiring employee #3 to modernize insurance","type":"job"},{"by":"alooPotato","id":16023705,"score":1,"time":1514484765,"title":"Write Server Side Kotlin at Streak (YC S11)","type":"job","url":"https:\/\/www.streak.com\/careers"}],"pagingInfo":{"pageNum":1,"pages":1,"url":"\/api\/jobs\/1"}}