{"by":"shipoftheseus","id":16030350,"score":1,"text":"About us:<p>Stitch Health is a care coordination platform for healthcare teams. Our mission is to deliver real impacts on healthcare outcomes by improving the ability for patients and providers to collaborate. Our software suite includes tools for team messaging, patient messaging, and patient management, delivered through modern web and mobile technologies. Our users are healthcare teams — consisting of doctors, nurses, social workers, pharmacists and more — and their patients.<p>Our technology recognizes the need for healthcare teams to easily access critical patient data wherever they are, from any device. To achieve this, our stack is Elixir&#x2F;Phoenix&#x2F;PostgreSQL on the back-end, React on the front-end, native iOS and Android, and Electron for desktop. Today, we’re a small but cohesive team. We’re growing fast and expanding our engineering team over the next several months.<p>Stitch is based in San Francisco, CA and is backed by some of the world&#x27;s best investors, including Benchmark Capital and Y Combinator. We&#x27;ve raised a Series A round and already serve over 70 healthcare organizations every day.<p>Available roles:<p>- Android Software Engineer<p>- iOS Software Engineer<p>- Electron Engineer<p>- Senior Frontend Engineer<p>- Senior Backend Engineer<p>- Software Architect<p>- QA Engineer<p>Some projects we&#x27;re working on:<p>- Architecture for adding in additional modules to our platform, enabling us to open new lines of business.<p>- Optimistic UI so providers can continue caring for patients across a range of suboptimal settings, from offline to low connectivity.<p>- Open API for customers to begin adding custom integrations.<p>- Analytics services that provides population health insights based on patient data flowing through Stitch teams, for example search term trends within Stitch.<p>This is a full-time role based in our San Francisco office.<p>For more information on each role: teamstitch.com&#x2F;jobs<p>Feel free to directly contact me as well: jonathan@teamstitch.com","time":1514566377,"title":"Stitch Health Hiring iOS, Android, Electron, React and Elixir Engineers","type":"job"}