{"by":"akashkkm","descendants":0,"id":16053214,"score":1,"text":"eInc. is the abbreviation for ethereum based incorporated. eInc is not a legal entity like Inc. but its a blockchain based organisation, Just like Cryptocurrencies which is not a legal currency. Major difference between Inc. and eInc. is its completely transparent runs without borders or restrictions. A Inc operations can only be visible to company officers and directors but in case of eInc. every thing works on proposals and voting which is visible to everyone. In eInc. everyone can see how much fund company have and how many shareholder(shares &amp; voting power), how many members(with their roles) and every single proposals and how many members voted on proposal. Because its cross border so there is no need to register different companies in different countries and do filling and maintenance. eInc is new generation organisation which can be regulated by only its members only.<p>Why should i register eInc company ?\n- Its transparent so anyone can see about company.\n- No more Board meeting’s, because any member can create proposal and others can vote yes&#x2F;no to pass or fail proposal.\n- Not even CEO &#x2F; Founder can withdraw single penny, because to withdraw fund or to do payment a proposal for that operation need to be Passed.\n- Investor will love to Fund in eInc because then they will be sure how invested fund is being used and to spend fund investor vote will also be counted.\n- Trust, because eInc runs on blockchain it cant be manipulated.<p>How to register eInc ?\nTo register eInc go to https:&#x2F;&#x2F;einc.io?rc=10000 (get $25 discount automatically using link) and follow these steps\nhttps:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=CVDYydneYes<p>Is there any Document required to register eInc. ?\nNo, You can register eInc in just 5 Minutes and no documents required.<p>How much it cost to register eInc. ?\nRegistration cost for eInc is Just $150 (for 12 characters in organisation name).<p>https:&#x2F;&#x2F;einc.io?rc=10000","time":1514912503,"title":"New Ethereum DApp “eInc.” Blockchain Organisation","type":"story"}