{"by":"MegaMan-athon","descendants":0,"id":16041740,"score":1,"text":"The TL;DR:\nWe are putting on a 72 hour Mega Man themed live stream for Child’s Play. There’ll be musical guests, prizes, and a bunch of Mega Man games to beat. Oh, and this year we are trying to break a world record for the most people dressed like wizards in a single room.\nJanuary 4-7th, 2018 on https:&#x2F;&#x2F;megamanathon.com&#x2F;, or live at MAGfest.<p>The Basics:\nWhat is the Mega Man-athon? \nAn annual, 72 hour non-stop gauntlet of Mega Man, Mega Man-inspired games and music to raise money for Child’s Play. It is hosted by MAGFest and presented by Half Empty E-Tank.<p>What was that about the world record for wizards?\nAccording to the Guinness Book of World Records, the largest gathering of wizards is 252 wizards. We think that’s an absurdly low number, so we are going to try and beat it.  We will have official, unbiased observers and a bunch of wizards during our music block on January 5th.<p>Who is Playing?\nWe’ll be playing the classics but also some weird stuff like “Street Fighter X Mega Man”, “Mega Man Xtreme”, “Mega Man 8-Bit Deathmatch” (a Doom mod), and even  the Mega Man Board game.<p>Notable (we think) players:\nEpic James of Epic Game Music\nMatt Papa of Inti Creates\nBlueMetal\nTterraj42 of TeamBN\nThe 8-Bit Duke<p>Musicians:\nThursday night we will be joined by the NPC Collective (Nerdy People of Color Collective), we will have performances by: Sammus, Shubzilla with Bill Beats, Amanda Lepre, Eye Q, D&amp;D Sluggers, Kadesh Flow, Ohm-I, and Ducky Dynamo.<p>Friday night we are going to break the world record for the largest gathering of wizards. Performances by: Super Soul Brothers, The X-Hunters, Flabbercasters, Crunk Witch, and 2 Mello.<p>Saturday night, DJ Cutman and the GameChops crew will be be tickling the ear drums of all present with their nerdy EDM with sets by Dj Cutman, Grimecraft, Ben Briggs, James Landino, Jadeabella, Wishlyst, Ralfington, VGR (Video Game Remixes),  and Flexstyle.","time":1514743649,"title":"Charity stream (Jan 4-7): Mega Man, Music and the world record for most wizards","type":"story"}