
{"items":[{"by":"crdb","descendants":0,"id":16043990,"score":5,"time":1514768490,"title":"Ask HN: What technical due diligence do you perform before M&A?","type":"story"},{"by":"gymshoes","descendants":3,"id":16046506,"kids":[16046565,16046828,16049327],"score":6,"text":"Reading articles on Hacker News I sometimes stumble on sites that have excellent typography with great line spacing and fonts that look great on all devices.\nWhat are some sites you&#x27;ve seen that have great typography?","time":1514822268,"title":"Ask HN: What sites have you seen that have great typography?","type":"story"},{"by":"mcrdev","descendants":8,"id":16042744,"kids":[16045445,16043031,16042999,16045157],"score":4,"text":"Hi HN<p>I&#x27;ve been reading people&#x27;s year end posts about what they&#x27;ve accomplished or learned in 2017 and it&#x27;s really inspired me to take concrete action towards a long term goal of mine. I&#x27;m a primary school teacher but I taught myself to code many years ago - I bought a palm pilot in 2000 and started writing little shareware apps for it. I&#x27;ve been building side projects (mostly websites) ever since.  I&#x27;d love to work full-time as a web developer.<p>I&#x27;m proficient in rails and php. I&#x27;m also learning js and vue . Over the years I&#x27;ve applied for several (remote) positions but I never get to the interview stage.  From a quick scan of my inbox, it&#x27;s mostly because I lack professional experience (8 companies). 2 companies turned me down due to lack of open source contributions (although I shared some code from side projects) and 1 company asked me to do a coding test but then turned me down because they didn&#x27;t like my solution (it was a simple string manipulation and I wrote a simple method - they&#x27;d have preferred it if I wrote a new String class). There are also many companies I&#x27;ve applied to who never bothered to write back.  All the roles I&#x27;ve applied for have been junior level.<p>Does anyone have any concrete, actionable advice that I can take to improve my chances of getting interviewed and hopefully hired?<p>Thanks in advance","time":1514752324,"title":"Ask HN: Help me get out of teaching and into software","type":"story"},{"by":"blocked_again","descendants":7,"id":16042262,"kids":[16043099,16044022,16042282,16042534,16044443,16048025,16042983],"score":5,"time":1514748479,"title":"Ask HN: What is your new year resolution?","type":"story"},{"by":"djinnandtonic","descendants":38,"id":16020433,"kids":[16021924,16021684,16020845,16020540,16021721,16021283,16021234,16021799,16028746,16023619,16020734,16020930,16020526,16023109,16021659,16021682,16024567,16024573,16020607,16021807,16020508,16020819],"score":29,"text":"Possibly late here, but why aren&#x27;t more &#x2F; all trains automated? The route is static; Speed should be easy to determine; AFAIK they aren&#x27;t mechanically unreliable enough to warrant a full-time mechanic on-board; LIDAR and image recognition can detect hazards on the track.<p>It seems silly that there have been such strides in automating automobiles before trains.","time":1514437664,"title":"Ask HN: Why isn't literally every train automated?","type":"story"},{"by":"whoishiring","descendants":52,"id":16052539,"kids":[16054200,16054016,16052924,16054019,16053853,16053713,16054066,16053392,16053714,16053089,16053286,16053201,16052802,16053493,16053036,16053741,16053202,16052736,16052997,16052886,16052833,16052936,16053046,16052715,16053270,16053420,16052599,16053072,16052777,16052793,16052622,16052750,16053057,16052929,16053210,16052939,16053247,16053540,16052657,16052685,16052759,16052839,16052866,16052770,16052714,16053383,16052962,16053319,16052985,16052831,16053363,16052717,16052778,16054134],"score":46,"text":"Please lead with either SEEKING WORK or SEEKING FREELANCER,\nyour location, and whether remote work is a possibility.","time":1514908508,"title":"Ask HN: Freelancer? Seeking freelancer? (January 2018)","type":"story"},{"by":"perseusprime11","descendants":2,"id":16044311,"kids":[16045630,16045147],"score":9,"time":1514774011,"title":"Ask HN: What new podcasts and books are you planning to listen or read in 2018?","type":"story"},{"by":"muzani","descendants":9,"id":16022190,"kids":[16023575,16023912,16023341,16024100,16023280,16022327,16022316,16023732],"score":18,"text":"For example, I want to write something like...<p>Test case: Login<p>1. If entering username &quot;abc&quot;, password &quot;admin&quot;, it would log in.<p>2. If entering password &quot;and&quot;, it will pop up error invalid password.<p>3. If entering password &quot;&quot;, it will disable the login button.<p>Surely someone has created a solution that handles something as repetitive as this? Most people use Word but formatting takes up quite a lot of time.","time":1514471922,"title":"Ask HN: What are tools for writing test case documents?","type":"story"},{"by":"ryeguy_24","descendants":51,"id":16048375,"kids":[16048504,16049024,16048561,16049761,16052092,16048530,16048496,16048721,16049069,16048562,16049084,16048473,16048839,16048594,16048648,16048777,16048563,16048616,16048722,16048593,16048497,16048449,16048567,16048911,16048408,16048714,16048764,16048746,16049419],"score":64,"text":"Enough is enough. It’s now 2018 and I’ve spent months trying to come up with good side business&#x2F;product ideas and have hit an analysis paralysis point with no good ideas. I’d like to focus on small business problems but just can’t seem to find any.  I’ve emailed businesses, scoured the web and am having little luck. My last product was a hypothesis that never gained traction so I’m now extra cautious (maybe too much) about jumping into any new unvalidated ideas.<p>Any entrepreneurial advice on how to get out of this funk? And also any advice&#x2F;approaches on how to identify a good idea?","time":1514845400,"title":"Ask HN: It’s 2018, what to build now?","type":"story"},{"by":"putnam","descendants":2,"id":16049423,"kids":[16051768,16049819],"score":6,"time":1514860478,"title":"Ask HN: Contractors: How did you learn to say no to work?","type":"story"},{"by":"hatsunearu","descendants":2,"id":16044727,"kids":[16044753,16045102],"score":4,"text":"I&#x27;m thinking of starting my blog, and one of the topics I want to touch involves manipulating some graphs and diagrams, and I&#x27;d like the user to play with the &quot;illustration&quot; itself.<p>I&#x27;m trying to find an easy-to-use framework that could get this job done. I haven&#x27;t done a ton of frontend dev, but I can wrap my head around programming concepts, btw. I&#x27;m sure a frontend dev doesn&#x27;t even need to ask this question, so I hope there are other people on the same boat as me.<p>edit: I do like what they&#x27;re doing at https:&#x2F;&#x2F;distill.pub&#x2F; -- not sure if the framework (if any) they are using is easy to work with.","time":1514781421,"title":"Ask HN: Any recommendations for an interactive web demo framework?","type":"story"},{"by":"joelg","descendants":67,"id":16024052,"kids":[16024652,16024316,16024558,16024198,16024496,16024633,16030821,16024334,16024738,16024278,16024129,16024330,16034593,16025752,16030289,16038962,16024195,16024339,16024259,16024157,16024595,16024978,16030212,16025351,16025057,16025080,16028338,16024708],"score":81,"time":1514487742,"title":"Ask HN: I feel like I've destroyed my attention span. How do I get it back?","type":"story"},{"by":"tmastro","descendants":7,"id":16029896,"kids":[16043333,16031814,16031684,16033110,16030649,16030986,16033775],"score":15,"text":"Would anyone be interested in a site to connect with other developers based on common interest in topics as well as programming languages? The purpose being to find people to work on side projects with.<p>Anything like this already exist? If so, what&#x27;s your experience with it?","time":1514561415,"title":"Ask HN: Connecting with other developers on side projects?","type":"story"},{"by":"mectors","descendants":1,"id":16042903,"kids":[16043492],"score":7,"text":"Let&#x27;s make 2018 better than 2017 and worse than 2019 ;-)","time":1514753597,"title":"Happy New Year","type":"story"},{"by":"kernelv","descendants":30,"id":16025942,"kids":[16028659,16026034,16026530,16038635,16026049,16026287,16026101,16033369,16027246,16043620,16029279,16028699,16026203,16028566,16029053,16029439,16029867,16028991,16032868,16038442,16034227],"score":26,"text":"...and what did you learn in the process","time":1514502772,"title":"Ask HN: What was your greatest accomplishment of 2017?","type":"story"},{"by":"superted","descendants":7,"id":16037060,"kids":[16039812,16044961,16040036,16044774,16040431,16039573,16038566],"score":10,"text":"Hey - 2018 is just one day away! Show the rest of us at HN what you actually shipped in 2017 that you are super proud of! Promote shamelessly, and don&#x27;t forget to include URLs!<p>I&#x27;ll go first; after a 10-years-or-so hiatus I finally got back at composing music, and completed 29 songs and 4 albums, this fall only: https:&#x2F;&#x2F;open.spotify.com&#x2F;artist&#x2F;4nxDh1lPq0EclBPMNXnYa3 and https:&#x2F;&#x2F;www.youtube.com&#x2F;channel&#x2F;UCgNm_EwMyLBrKp_kmdU3XoA","time":1514663000,"title":"Ask HN: What's the best thing(s) you shipped in 2017?","type":"story"},{"by":"dennisvdvliet","descendants":47,"id":16023771,"kids":[16024557,16024079,16023875,16035288,16024740,16024504,16024554,16024783,16024797,16024541,16024118,16024016,16027332,16024795,16023855,16024410],"score":26,"text":"Seen the recent issues with Apple hard- and software I’m not 100% sure I want to replace my 2015 MacBook Pro with a 2017 MacBook pro. What are your suggestions for a decent replacement?<p>I’m looking for something the size of a MacBook that can run Ubuntu or something similar. Good boos quality and a good screen.","time":1514485390,"title":"Ask HN: What to replace my MacBook with?","type":"story"},{"by":"gallerdude","descendants":13,"id":16035556,"kids":[16037877,16037518,16037912,16039605,16039749,16035916,16037139,16036283],"score":11,"time":1514646799,"title":"Ask HN: What are your New Years resolutions?","type":"story"},{"by":"lin0tune","descendants":0,"id":16040640,"score":2,"text":"I am currently a lead developper at a small company (40 people, 10 developers.) We provide enterprise solutions in two domains: Interactive terminals and Mobile apps&#x2F;web.<p>The CEO is asking me to set up an offshore outsourcing office&#x2F;branch in Vietnam with 7 people, including 5 developers.<p>I am looking for any advices&#x2F;resources&#x2F;directions that can help me relise the project.<p>Thank you!","time":1514729969,"title":"Ask HN: Books\/Resources\/Advices to set up a new outsourcing office\/branch","type":"story"},{"by":"_Tyler","descendants":10,"id":16021740,"kids":[16050503,16023160,16022024,16025520,16039458,16026741,16022824],"score":12,"text":"Hi! I am about to end a two year contract working overseas, and I don’t love my current line of work. I’ve been teaching myself python, django, javascript, html, css etc with some CS fundamentals, algorithms on firecode.io and a few lessons on http:&#x2F;&#x2F;www.fast.ai for fun for the past two years.<p>I’m returning to the states in about a month and I’m trying to decide if I should just look for junior dev jobs and get some hard experience, or if I should look into getting a masters in CS, or a masters in ML .<p>In terms of future long term job security, earnings, etc, which of the three options would you recommend?<p>FYI, I’m a 27 year-old male who will probably be moving back to the Austin, TX area.","time":1514465553,"title":"Ask HN: Masters in CS, ML, or get a job?","type":"story"},{"by":"freeelncer","descendants":8,"id":16038648,"kids":[16040809,16039755,16039795,16041466,16039261,16038715],"score":7,"time":1514681522,"title":"Ask HN: Why do so many startups invest so little in design?","type":"story"},{"by":"putnam","descendants":0,"id":16044674,"score":4,"time":1514780354,"title":"Ask HN: What was the ugliest trend in software development in 2017?","type":"story"},{"by":"gatsby","descendants":14,"id":16035838,"kids":[16036725,16037679,16036238,16036362,16035900,16039557,16036759,16040755,16039614,16038432,16038007],"score":13,"time":1514650585,"title":"Ask HN: Best books you read in 2017?","type":"story"},{"by":"febin","descendants":9,"id":16035451,"kids":[16035848,16037478,16037579],"score":7,"time":1514645582,"title":"Ask HN: How does mining difficulty help Bitcoin?","type":"story"},{"by":"illwrks","descendants":5,"id":16035086,"kids":[16037938,16036803,16041673],"score":2,"text":"My day-to-day job is as a Digital Designer and I&#x27;m a self taught front-end developer.<p>My wife has suggested that because I&#x27;m self taught I should probably get some certification to back up what I say I can do (which makes sense I guess!)<p>So my new years resolution...<p>Does anyone know any short recognised courses in PHP, Mysql, Python or front-end ones for Angular etc?<p>Thanks!\nIll","time":1514639140,"title":"Courses in London?","type":"story"},{"by":"k4ch0w","descendants":18,"id":16026537,"kids":[16029755,16038996,16027829,16028725,16029241,16027054,16029124,16029148,16038897,16026942,16026835,16027263,16043632,16034559,16029318,16032108,16026566],"score":5,"time":1514508474,"title":"Ask HN: What are some items you have on your desk?","type":"story"},{"by":"aetherspawn","descendants":2,"id":16034727,"kids":[16034735,16035342],"score":3,"text":"I am open sourcing a thing that my small company will &quot;sponsor&quot; development time towards every now and then. I made a doc&#x2F; folder and put our logo in it and put it at the bottom of the README.<p>The repo has an MIT license in the root folder and a note in the README to refer to that license.<p>Have I done something that&#x27;s legally a problem, i.e. is my company&#x27;s branding and name now MIT licensed?","time":1514631169,"title":"Ask HN: Is shipping my companys branding in a MIT repo a legal risk?","type":"story"},{"by":"fadymak","descendants":1,"id":16025333,"kids":[16025602],"score":3,"text":"Mostly just curious on how Google tests changes to its search results ranking algorithm to ensure those changes work as expected for a significantly sized sample from its population as well as ensuring there is no regression (one change to the algorithm undoes another)<p>Or perhaps, how would you go about it taking the Google’s scale into consideration.","time":1514498692,"title":"Ask HN: How does Google QA its search results ranking algorithms?","type":"story"},{"by":"putnam","descendants":2,"id":16046078,"kids":[16046098,16046901],"score":3,"time":1514815378,"title":"Ask HN: What do you want to accomplish in 2018?","type":"story"},{"by":"prmph","descendants":3,"id":16021380,"kids":[16029742],"score":3,"text":"Would anyone like to share their experiences running R in Postgres? I&#x27;m evaluating accessing R packages from a remote Postgres db rather than using something like OpenCPU","time":1514458413,"title":"Ask HN: Any experience running R within Postgres?","type":"story"}],"pagingInfo":{"pageNum":2,"pages":3,"url":"\/api\/ask\/2"}}