
{"items":[{"by":"ausrname1","descendants":9,"id":16030951,"kids":[16031777,16031260,16031153,16031072,16039317,16031067],"score":8,"text":"With even the coding bootcamps having mostly moved on from Ruby&#x2F;Rails, is it still worthwhile today to begin a project in Rails or to learn Rails as a beginning developer?","time":1514572014,"title":"Ask HN: Is Ruby\/Rails over?","type":"story"},{"by":"febin","descendants":2,"id":16027921,"kids":[16027978,16028812],"score":8,"time":1514527486,"title":"Ask HN: Is there demand for Ethereum developers?","type":"story"},{"by":"gomangogo","descendants":5,"id":16026376,"kids":[16034302,16028113],"score":4,"time":1514506712,"title":"Ask HN: What is the best tools\/strategy for fully encrypted email communication?","type":"story"},{"by":"oftenwrong","descendants":6,"id":16024668,"kids":[16033203,16027037,16033759],"score":5,"text":"I want to convert some articles and books to audio so that I can listen to them while walking. I would like to try the current leader in commercially-available text-to-speech.<p>I have tried a few text-to-speech offerings, such as the ones included in Firefox and macOS, but they sound robotic to the point that they are difficult to listen to. The pacing is unnatural. I am hoping there is something available that is better.","time":1514493031,"title":"Ask HN: Who makes the most advanced text-to-speech technology?","type":"story"},{"by":"Eliahu_horwi","descendants":8,"id":16023080,"kids":[16029290,16023169,16023110,16027893],"score":7,"text":"Hi all, \nI have been coding for the last 4 years, about 15 hours a day, 9 in my day job and another six on 2 failed side projects. I am now in a senior position but lately I feel like nothing new is happening and every challenge is the same old one with a different title. I am starting to rethink my path as a developer. Thinking I need to get into new fields of coding I have started coding blockchain and AI, at first it was magic, nothing like any code I ever knew but now 6 month later its starting to smell the same and I know in a few month it will get old. \nI am a person who always needs new and interesting challenges and I feel like the software industry can no longer provide me with them, of course, there will always be new challenges but I feel they are all of the same type. \nHow do you keep the drive after so long? \nalternatively what job in the tech industry or out of the tech industry could you recommend where every day is fight or flight, a battle for survival where if I fall asleep on my watch I will lose?<p>Thanks","time":1514479157,"title":"How do you keep the drive after years of development?","type":"story"},{"by":"newChatBuilder","descendants":8,"id":16021814,"kids":[16023965,16021971,16023814,16023586,16021867],"score":6,"text":"I live and work in a a European SF wanna be city. There is a fair amount of devs living around working here but almost no sense of community.<p>I want to start a chat application that targets specifically people working&#x2F;living here, as a side project. And I&#x27;m wondering if there has been already proven harmonization strategy for &quot;targeted chat&quot; applications.","time":1514466990,"title":"Ask HN: Is it possible to monitize chat?","type":"story"},{"by":"rayalez","descendants":3,"id":16020991,"kids":[16047223,16026059,16023703],"score":4,"time":1514450162,"title":"Ask HN: What is the best way to learn copywriting?","type":"story"},{"by":"putnam","descendants":8,"id":16030673,"kids":[16032738,16030774,16032043,16034515],"score":10,"time":1514569552,"title":"Ask HN: Is consulting a safer career path than software engineering?","type":"story"}],"pagingInfo":{"pageNum":3,"pages":3,"url":"\/api\/ask\/3"}}